In [1]:
import pandas as pd

In [4]:
data='{"employee":"James","email":"james12@gmail.com","job_profile":[{"title1":"team lead","title2":"software developer"}]}'
type(data)

str

In [36]:
data='{"employee":"James","email":"james12@gmail.com","job_profile":[{"title1":"team lead","title2":"software developer"}]}'
type(data)

str

In [5]:
pd.read_json(data)

,employee,email,job_profile
0,James,james12@gmail.com,"{'title1': 'team lead', 'title2': 'software de..."

In [6]:
pd.read_json(data,orient='index')

                                                             0
employee                                                 James
email                                        james12@gmail.com
job_profile  [{'title1': 'team lead', 'title2': 'software d...

In [8]:
pd.read_json(data,orient='columns')

,employee,email,job_profile
0,James,james12@gmail.com,"{'title1': 'team lead', 'title2': 'software de..."

In [9]:
pd.read_json(data,orient='records')

,employee,email,job_profile
0,James,james12@gmail.com,"{'title1': 'team lead', 'title2': 'software de..."

In [11]:
df=pd.DataFrame([['a','b'],['c','d']],
       index=['row1','row2'], columns=['col1','col2'])

In [12]:
df.head()

     col1 col2
row1    a    b
row2    c    d

In [13]:
df.to_json()

'{"col1":{"row1":"a","row2":"c"},"col2":{"row1":"b","row2":"d"}}'

In [17]:
df.to_json(orient='index')

'{"row1":{"col1":"a","col2":"b"},"row2":{"col1":"c","col2":"d"}}'

In [18]:
df.to_json(orient='columns')

'{"col1":{"row1":"a","row2":"c"},"col2":{"row1":"b","row2":"d"}}'

In [19]:
df.to_json(orient='table')

'{"schema":{"fields":[{"name":"index","type":"string"},{"name":"col1","type":"string"},{"name":"col2","type":"string"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":"row1","col1":"a","col2":"b"},{"index":"row2","col1":"c","col2":"d"}]}'

In [28]:
df=pd.read_csv('C:/Users/bansa/Downloads/archive (11)/housing_price_dataset.csv',header=None)

In [29]:
df.head()

,0,1,2,3,4,5
0,SquareFeet,Bedrooms,Bathrooms,Neighborhood,YearBuilt,Price
1,2126,4,1,Rural,1969,215355.28361820139
2,2459,3,2,Rural,1980,195014.22162584803
3,1860,2,1,Suburb,1970,306891.0120763329
4,2294,2,1,Urban,1996,206786.78715332696